In [40]:
import pandas as pd
import warnings
warnings.filterwarnings("ignore")

In [41]:
import openpyxl
xls=pd.ExcelFile('/home/placenent/Documents/location.xlsx',engine='openpyxl')
data=pd.read_excel(xls)

In [42]:
data.describe()

       Latitude   Longitude
count   8.00000    8.000000
mean   31.62435   46.451738
std    29.50796   47.605790
min   -26.33000    4.670000
25%    18.41500   12.605000
50%    41.94240   23.150500
75%    50.76000   78.657500
max    64.00000  138.252900

In [43]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Country    8 non-null      object
 1   Latitude   8 non-null      float64
 2   Longitude  8 non-null      float64
 3   Language   8 non-null      object
dtypes: float64(2), object(2)
memory usage: 384.0+ bytes

In [44]:
data.head()

   Country  Latitude  Longitude Language
0  Austria     47.68      13.33  English
1  Beljium     50.63       4.67  English
2  Germany     51.15      10.43   German
3   Norway     64.00      18.30  English
4    India     22.00      78.00    Hindi

In [45]:
x=data.drop(['Country','Language'],axis=1)
x

   Latitude  Longitude
0   47.6800    13.3300
1   50.6300     4.6700
2   51.1500    10.4300
3   64.0000    18.3000
4   22.0000    78.0000
5    7.6600    80.6300
6  -26.3300    28.0010
7   36.2048   138.2529

In [58]:
#
from sklearn.cluster import KMeans
kmeans=KMeans(n_clusters=4)
y_pred=kmeans.fit_predict(x)
y_pred=kmeans.predict(x)

In [59]:
y_pred

array([0, 0, 0, 0, 1, 1, 2, 3], dtype=int32)

In [60]:
data['catagory']=y_pred

In [61]:
data

        Country  Latitude  Longitude  Language  catagory
0       Austria   47.6800    13.3300   English         0
1       Beljium   50.6300     4.6700   English         0
2       Germany   51.1500    10.4300    German         0
3        Norway   64.0000    18.3000   English         0
4         India   22.0000    78.0000     Hindi         1
5     Sri Lanka    7.6600    80.6300   Simhala         1
6  South Africa  -26.3300    28.0010   English         2
7         Japan   36.2048   138.2529  Japanese         3